Show / Hide Table of Contents
Enum TypeOfSupportConditions
Define type of support conditions
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum TypeOfSupportConditions
Fields
 Name |  Description
 Bearing
Bearing provided
 Cantilever
Cantilever
 Continuous
Continuous members
 FullyRestrained
Supports considered fully restrained
 NonContinuous
Non-continuous members
 Improve this Doc
 View Source